// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
/*
function s (a, b) {
    document.write(`${a * b}`)
}
 s(10, 20)
*/


//--------------------------------------------------------------------------------------------------------------


// - створити функцію яка обчислює та повертає площу кола з радіусом r
/*
const pi = 3.14
function s (r) {
    document.write(`${r ** 2 * pi}`)
}
s (5)
*/


//--------------------------------------------------------------------------------------------------------------


// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r 2piRH
/*
const pi = 3.14
function s (h, r) {
    document.write(`${2 * pi * r * h}`)
}
s (3, 10)
*/


//--------------------------------------------------------------------------------------------------------------


// - створити функцію яка приймає масив та виводить кожен його елемент
/*
function array(arr) {
    for (const arrElement of arr) {
        console.log(arrElement)
    }
}
let x = [1, 2, 3, 4, 5, 6, 7, 8, 9]
array(x)
*/


//--------------------------------------------------------------------------------------------------------------


// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
/*
function text (p) {
    document.write(`<p>${p}</p>`)
}
text ('Hello World')
*/


//--------------------------------------------------------------------------------------------------------------


// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
/*
function list (x) {
    document.write(`<ul>
                        <li>${x}</li>
                        <li>${x}</li>
                        <li>${x}</li>
                    </ul>`)
}
list ('list item')
*/


//--------------------------------------------------------------------------------------------------------------


// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
// Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
/*
function list (item, x) {
    document.write(`<ul>`)
    for (let i = 0; i < x; i++) {
       document.write(`<li>${item}</li>`)
    }
    document.write(`</ul>`)
}
list ('hello', 10)
*/


//--------------------------------------------------------------------------------------------------------------


// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
/*
let x = [3, true, 'hello', 11, false, 'bye']
function list (arr) {
    document.write(`<ul>`)
    for (const arrElement of arr) {
        document.write(`<li>${arrElement}</li>`)
    }
    document.write(`</ul>`)
}
list (x)
*/


//--------------------------------------------------------------------------------------------------------------


// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ.
// Для кожного об'єкту окремий блок.
/*
let persons = [
    {id: 1, name: 'Ivan', age: 25},
    {id: 2, name: 'Maria', age: 24},
    {id:3, name:'Valeriy', age: 30},
    {id:4, name:'Viktoriya', age: 29}
]
function x (arr) {
    for (const arrElement of arr) {
        document.write(`<div>`)
        for (const arrElementKey in arrElement) {
            document.write(`${arrElementKey}: ${arrElement[arrElementKey]} `)

        }

        document.write(`</div>`)
    }
}
x(persons)
*/


//--------------------------------------------------------------------------------------------------------------


// - створити функцію яка повертає найменьше число з масиву
/*
let x = [1, 4, -1, 0, -4, 3, 5, 7, 2, -100, 8,]
function getMinNum(arr) {
    let min = arr[0]
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] < min) {
            min = arr[i]
        }
    }
    document.write(`${min}`)
}

getMinNum(x)
*/


//--------------------------------------------------------------------------------------------------------------


// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
/*
function x (arr) {
    let res = 0
    for (const arrElement of arr) {
        res = res + arrElement
    }
    document.write(`${res}`)
}
let a = [10, 20, 30, -10, -20, 20]
x(a)
*/
